from openpyxl import Workbook

wb = Workbook()
ws = wb.active

category = {
    "출석": 10,
    "퀴즈1": 10,
    "퀴즈2": 10,
    "중간고사": 20,
    "기말고사": 30,
    "프로젝트": 20
}

score = [[1, 10, 8, 5, 14, 26, 12],
         [2, 7, 3, 7, 15, 24, 18],
         [3, 9, 5, 8, 8, 12, 4],
         [4, 7, 8, 7, 17, 21, 18],
         [5, 7, 8, 7, 16, 25, 15],
         [6, 3, 5, 8, 8, 17, 0],
         [7, 4, 9, 10, 16, 27, 18],
         [8, 6, 6, 6, 15, 19, 17],
         [9, 10, 10, 9, 19, 30, 19],
         [10, 9, 8, 8, 20, 25, 20]]

#########################################################################################################


def set_category():
    # 분류 입력
    arr = ["학번"]

    for i in category:
        arr.append(i)
        # print(i)

    arr.append("총점")
    arr.append("성적")
    ws.append(arr)

#########################################################################################################


def set_score():
    # 점수 입력
    for i in range(0, len(score)):
        # print(score[i])
        ws.append(score[i])

#########################################################################################################


def fix_quiz2():
    # 퀴즈2 문제 오류로 모두 만점(10점) 처리
    for i in range(2, 12):
        ws.cell(column=4, row=i, value=10)

#########################################################################################################


def get_total():
    # 총점 계산
    col = ws["B2:G11"]
    row_num = 2

    for i in col:
        # f string 사용
        ws.cell(column=8, row=row_num, value=f"=sum(B{row_num}:G{row_num})")
        row_num = row_num + 1

#########################################################################################################


def init():
    set_category()
    set_score()
    fix_quiz2()
    get_total()
    wb.save("quiz.xlsx")


init()
